FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M7_SAMV71_Xplained_IAR_Keil/libchip_samv7/include/samv7/component/component_isi.h
#define ISI_DMA_CHDR_C_CH_DIS          ( 0x1u << 1 )                    /**< \brief (ISI_DMA_CHDR) Codec Channel Disable Request */
/* -------- ISI_DMA_CHSR : (ISI Offset: 0x40) DMA Channel Status Register -------- */
#define ISI_DMA_CHSR_P_CH_S            ( 0x1u << 0 )                    /**< \brief (ISI_DMA_CHSR) Preview DMA Channel Status */
#define ISI_DMA_CHSR_C_CH_S            ( 0x1u << 1 )                    /**< \brief (ISI_DMA_CHSR) Code DMA Channel Status */
/* -------- ISI_DMA_P_ADDR : (ISI Offset: 0x44) DMA Preview Base Address Register -------- */
#define ISI_DMA_P_ADDR_P_ADDR_Pos      2
#define ISI_DMA_P_ADDR_P_ADDR_Msk      ( 0x3fffffffu << ISI_DMA_P_ADDR_P_ADDR_Pos ) /**< \brief (ISI_DMA_P_ADDR) Preview Image Base Address */
#define ISI_DMA_P_ADDR_P_ADDR( value )    ( ( ISI_DMA_P_ADDR_P_ADDR_Msk & ( ( value ) << ISI_DMA_P_ADDR_P_ADDR_Pos ) ) )
/* -------- ISI_DMA_P_CTRL : (ISI Offset: 0x48) DMA Preview Control Register -------- */
#define ISI_DMA_P_CTRL_P_FETCH         ( 0x1u << 0 ) /**< \brief (ISI_DMA_P_CTRL) Descriptor Fetch Control Bit */
#define ISI_DMA_P_CTRL_P_WB            ( 0x1u << 1 ) /**< \brief (ISI_DMA_P_CTRL) Descriptor Writeback Control Bit */
#define ISI_DMA_P_CTRL_P_IEN           ( 0x1u << 2 ) /**< \brief (ISI_DMA_P_CTRL) Transfer Done Flag Control */
#define ISI_DMA_P_CTRL_P_DONE          ( 0x1u << 3 ) /**< \brief (ISI_DMA_P_CTRL) Preview Transfer Done */
/* -------- ISI_DMA_P_DSCR : (ISI Offset: 0x4C) DMA Preview Descriptor Address Register -------- */
#define ISI_DMA_P_DSCR_P_DSCR_Pos      2
#define ISI_DMA_P_DSCR_P_DSCR_Msk      ( 0x3fffffffu << ISI_DMA_P_DSCR_P_DSCR_Pos ) /**< \brief (ISI_DMA_P_DSCR) Preview Descriptor Base Address */
#define ISI_DMA_P_DSCR_P_DSCR( value )    ( ( ISI_DMA_P_DSCR_P_DSCR_Msk & ( ( value ) << ISI_DMA_P_DSCR_P_DSCR_Pos ) ) )
/* -------- ISI_DMA_C_ADDR : (ISI Offset: 0x50) DMA Codec Base Address Register -------- */
#define ISI_DMA_C_ADDR_C_ADDR_Pos      2
#define ISI_DMA_C_ADDR_C_ADDR_Msk      ( 0x3fffffffu << ISI_DMA_C_ADDR_C_ADDR_Pos ) /**< \brief (ISI_DMA_C_ADDR) Codec Image Base Address */
#define ISI_DMA_C_ADDR_C_ADDR( value )    ( ( ISI_DMA_C_ADDR_C_ADDR_Msk & ( ( value ) << ISI_DMA_C_ADDR_C_ADDR_Pos ) ) )
/* -------- ISI_DMA_C_CTRL : (ISI Offset: 0x54) DMA Codec Control Register -------- */
#define ISI_DMA_C_CTRL_C_FETCH         ( 0x1u << 0 ) /**< \brief (ISI_DMA_C_CTRL) Descriptor Fetch Control Bit */
#define ISI_DMA_C_CTRL_C_WB            ( 0x1u << 1 ) /**< \brief (ISI_DMA_C_CTRL) Descriptor Writeback Control Bit */
#define ISI_DMA_C_CTRL_C_IEN           ( 0x1u << 2 ) /**< \brief (ISI_DMA_C_CTRL) Transfer Done Flag Control */
#define ISI_DMA_C_CTRL_C_DONE          ( 0x1u << 3 ) /**< \brief (ISI_DMA_C_CTRL) Codec Transfer Done */
/* -------- ISI_DMA_C_DSCR : (ISI Offset: 0x58) DMA Codec Descriptor Address Register -------- */
#define ISI_DMA_C_DSCR_C_DSCR_Pos      2
#define ISI_DMA_C_DSCR_C_DSCR_Msk      ( 0x3fffffffu << ISI_DMA_C_DSCR_C_DSCR_Pos ) /**< \brief (ISI_DMA_C_DSCR) Codec Descriptor Base Address */
#define ISI_DMA_C_DSCR_C_DSCR( value )    ( ( ISI_DMA_C_DSCR_C_DSCR_Msk & ( ( value ) << ISI_DMA_C_DSCR_C_DSCR_Pos ) ) )
/* -------- ISI_WPCR : (ISI Offset: 0xE4) Write Protection Control Register -------- */
#define ISI_WPCR_WPEN                  ( 0x1u << 0 )                       /**< \brief (ISI_WPCR) Write Protection Enable */
#define ISI_WPCR_WPKEY_Pos             8
#define ISI_WPCR_WPKEY_Msk             ( 0xffffffu << ISI_WPCR_WPKEY_Pos ) /**< \brief (ISI_WPCR) Write Protection Key Password */
#define   ISI_WPCR_WPKEY_PASSWD        ( 0x495349u << 8 )                  /**< \brief (ISI_WPCR) Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0. */
/* -------- ISI_WPSR : (ISI Offset: 0xE8) Write Protection Status Register -------- */
#define ISI_WPSR_WPVS                  ( 0x1u << 0 )                       /**< \brief (ISI_WPSR) Write Protection Violation Status */
#define ISI_WPSR_WPVSRC_Pos            8
#define ISI_WPSR_WPVSRC_Msk            ( 0xffffu << ISI_WPSR_WPVSRC_Pos )  /**< \brief (ISI_WPSR) Write Protection Violation Source */
/* -------- ISI_VERSION : (ISI Offset: 0xFC) Version Register -------- */
#define ISI_VERSION_VERSION_Pos        0
#define ISI_VERSION_VERSION_Msk        ( 0xfffu << ISI_VERSION_VERSION_Pos ) /**< \brief (ISI_VERSION) Version of the Hardware Module */
#define ISI_VERSION_MFN_Pos            16
#define ISI_VERSION_MFN_Msk            ( 0x7u << ISI_VERSION_MFN_Pos )       /**< \brief (ISI_VERSION) Metal Fix Number */

/*@}*/


#endif /* _SAM_ISI_COMPONENT_ */
